package Creational.AbstractFactory.problem;

/**
Create object families.

Цель:
 Создает интерфейс для создания семьи связанных и зависимых объектов без определения их конкретных классов. Kit

 Для чего:
 1. Создание продуктов независимо от прилаги.
 2. Сконфигурировать семьи продукта
 3. Спрятать реализацию продукта, оставить только интерфейс его создания.

 Приемущества:
 - контроль классов объектов которые созданы
 - изменение семей продуктов осуществляется легко
 - согласованность между продуктами (централизация)








 */

public class AbstractFac {
}
